insert into car_service (service_id, service_name, service_phone_number, service_address) value
    (1, 'Леон-авто', '+79234853476' , 'Амурская 9'),
    (2, 'Темп','+78433768271','Пологая 5'),
    (3, 'Желтый бокс','+76543267181','Жигура 3а'),
    (4, 'Айр-авто','+76326221788','Победы 5');

insert into car_status (status_id, status) value (0, 'Свободна'),
    (1, 'В работе'),
    (2, 'Бронь'),
    (3, 'В сервисе');

insert into car_types (type_id, type_name) value (1, 'SUV'),
    (2, 'Truck'),
    (3, 'Sedan'),
    (4, 'Coupe'),
    (5, 'Wagon'),
    (6, 'Sports Car'),
    (7, 'Crossover'),
    (8, 'Van'),
    (9, 'Luxury Car');

insert into car_brand (car_brand_id, car_brand_name, car_country_prod) value (1, 'Toyota', 'Japan'),
    (2, 'Nissan', 'Japan'),
    (3, 'Honda', 'Japan'),
    (4, 'Suzuki', 'Japan'),
    (5, 'BMW', 'Germany'),
    (6, 'Audi', 'Germany'),
    (7, 'Mercedes', 'Germany'),
    (8, 'Volvo', 'Germany'),
    (9, 'Volkswagen', 'Germany'),
    (10, 'Jaguar', 'UK'),
    (11, 'RangeRover', 'UK'),
    (12, 'Ford', 'USA'),
    (13, 'Dodge', 'USA'),
    (14, 'Chevrolet', 'USA'),
    (15, 'Cadillac', 'USA'),
    (16, 'KIA', 'Korea'),
    (17, 'Daewoo', 'Korea');

insert into customer value (1, 'Петр', 'Иванов', '+79233458714', 'Новосибирск ул.Васюкова 13 кв.3', 'Россия',
                            '1977-05-02',0492,657837),
    (2, 'Кирил', 'Звиганов', '+7765796847', 'Хабаровск ул.Злыдня 53 кв.23', 'Россия', '1967-01-22',6372,567837),
    (3, 'Михаил', 'Пирогов', '+7265756848', 'Земск ул.Окатовая 3 кв.3', 'Россия', '1987-11-02',7591,654271),
    (4, 'Евгений', 'Каримов', '+7165756842', 'Холмск ул.Печерская 91 кв.91', 'Россия', '1979-03-02',7832,983718),
    (5, 'Трофим', 'Бодров', '+7765956843', 'Владивосток ул.Суханова 11 кв.1', 'Россия', '1951-03-12',7321,987632),
    (6, 'Дмитрий', 'Картавый', '+7565756844', 'Корсаков ул.Русская 12 кв.34', 'Россия', '1968-04-01',4764,426872),
    (7, 'Сергей', 'Ильин', '+7566392844', 'Тула ул.Покровская 15 кв.14', 'Россия', '1998-09-01',3364,666872),
    (8, 'Михаил', 'Прокопенко', '+7837465055', 'Петрозаводск ул.Жмыха 312 кв.134', 'Россия', '1955-11-08',4555,126333),
    (9, 'Роман', 'Песков', '+7333752673', 'Ильинск ул.Ленина 92 кв.99', 'Россия', '1999-12-12',6664,127342),
    (10, 'Тимофей', 'Родионов', '+7678756811', 'Новосибирск ул.Алеутская 212 кв.77', 'Россия', '1979-06-07',5564,556899),
    (11, 'Дмитрий', 'Колобасов', '+7767752291', 'Иркутск ул.Светланская 152 кв.14', 'Россия', '1988-09-03',1188,776833),
    (12, 'Семен', 'Слепаков', '+7432756712', 'Челябинск ул.Юмашева 312 кв.11', 'Россия', '1991-08-08',1164,426774);

insert into cars value (1, 1, 'Crown', 'х432ке777', '2016-02-01', 3, 'AT', 'Gasoline', 50321, 500, 0),
    (2, 2, 'Sunny', 'у756рх125', '2011-12-05', 3, 'AT', 'Gasoline', 120321, 200,1),
    (3, 2, 'Sunny', 'е506хх125', '2012-01-05', 3, 'AT', 'Gasoline', 232321, 200,2),
    (4, 5, 'M3', 'н666ре775', '2001-11-05', 3, 'AT', 'Gasoline', 10321, 700,1),
    (5, 3, 'CR-V', 'с706са775', '2014-02-05', 7, 'AT', 'Gasoline', 10321, 400,1),
    (6, 16, 'Rio', 'р601со777', '2019-12-01', 3, 'AT', 'Gasoline', 70345, 200,2),
    (7, 16, 'Rio', 'р611со777', '2019-12-02', 3, 'AT', 'Gasoline', 80355, 200,3),
    (8, 16, 'Rio', 'р612со777', '2019-12-01', 3, 'AT', 'Gasoline', 60211, 200,0),
    (9, 16, 'Rio', 'р613со777', '2019-12-02', 3, 'AT', 'Gasoline', 83312, 200,0),
    (10, 1, 'Crown', 'х123см125', '2015-02-01', 3, 'AT', 'Gasoline', 180432, 400,3),
    (11, 12, 'Mondeo', 'е101ее777', '2018-10-01', 3, 'AT', 'Gasoline', 280766, 300,1),
    (12, 3, 'Accord', 'а789ее125', '2017-04-01', 3, 'AT', 'Gasoline', 177354, 300,0),
    (13, 1, 'LandCruiserPrado', 'в899аа124', '2015-06-01', 1, 'AT', 'Diesel', 277333, 700,0),
    (14, 2, 'Pajero', 'c999ca69', '2018-11-01', 1, 'AT', 'Diesel', 77231, 600,1),
    (15, 1, 'Prius', 'х919cк169', '2019-01-01', 3, 'AT', 'Hybrid', 17721, 300,2),
    (16, 3, 'HR-V', 'c531кк111', '1999-03-01', 7, 'AT', 'Gasoline', 200121, 300,3),
    (17, 5, 'X1', 'у911тт198', '2019-12-01', 7, 'AT', 'Diesel', 7121, 600,1),
    (18, 14, 'Captiva', 'а191уу777', '2015-07-01', 3, 'AT', 'Gasoline', 118121, 600,0);

insert into rent value (1 , 2 , 3 , '2020-01-01 12:03','2020-01-05 12:01'),
    (2 , 7 , 4 , '2020-01-01 11:55','2020-01-07 11:10'),
    (3 , 3 , 8 , '2020-02-04 10:40','2020-02-05 13:55'),
    (4 , 8 , 3 , '2020-02-04 20:15','2020-02-06 20:05'),
    (5 , 7 , 5 , '2020-02-04 19:10','2020-02-07 19:10'),
    (6 , 1 , 10 , '2020-02-05 15:25','2020-02-08 15:15'),
    (7 , 11 , 2 , '2020-04-20 15:25',NULL),
    (8 , 10 , 4 , '2020-04-20 15:45',NULL),
    (9 , 4 , 5 , '2020-04-20 10:00',NULL),
    (10 , 5 , 11 , '2020-04-21 11:00',NULL),
    (11 , 9 , 14 , '2020-04-21 13:25',NULL),
    (12 , 2 , 17 , '2020-04-21 14:45',NULL);

insert into maintenance value (1 ,7, '2019-12-10','2019-12-11',2),
    (2 ,10, '2020-01-17','2020-01-18',3),
    (3 ,16, '2020-03-01','2020-03-03',1);

insert into reservation value (1, 3 ,'2020-05-01 10:00' ,8),
    (2, 6 ,'2020-05-03 16:00' ,4);
